In [1]:
import pandas as pd

In [2]:
# There are two main data type in pandas 
# first one is series

In [5]:
my_series = pd.Series(["Rk", "Saurabh", "Avishkar", "Sushant", "Nachiket"])

In [6]:
my_series

0          Rk
1     Saurabh
2    Avishkar
3     Sushant
4    Nachiket
dtype: object

In [7]:
# series is one dimensional always like the following test that I have done and will be doing

In [8]:
colors = pd.Series(["Orange", "Black", "Yellow", "Green", "White"])

In [9]:
colors

0    Orange
1     Black
2    Yellow
3     Green
4     White
dtype: object

In [10]:
# Dataframe is 2 dimensional and it is more common than that of the series

In [12]:
# As we know that data frame is two dimensinal and hence it will be made up of many large number of one dimensional series
# We can make the dataframe out of series after combining all the series into a datafram

In [13]:
my_dataframe = pd.DataFrame({"Friends" : my_series, "Colors" : colors})

In [14]:
my_dataframe

    Friends  Colors
0        Rk  Orange
1   Saurabh   Black
2  Avishkar  Yellow
3   Sushant   Green
4  Nachiket   White

In [15]:
# here we have created the datafram out of series
# But this will not be possible everytime right

In [16]:
# There will be a case where you will want to have the dataframe ready from the csv files
# and it will be impossible in real life cases where we will create out own dataframe every time
# We have to get the required and useful data from the industry that we are working in and hence we have to make the model based on the data that we will be getting out of it
# Hence we have to make sure that the data will be used

In [17]:
# Now we will learn how to import the csv file from the system and make that file to get converted into dataframe

In [18]:
car_data = pd.read_csv("car_sales.csv")

In [19]:
car_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [20]:
car_data2 = pd.read_csv("car_sales1.csv")

In [21]:
car_data2

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [22]:
# Yeah actually I got the files from the trainer named these two files and wanted to check if these two files are same or different

In [23]:
# whenever we want to address the dataframe by using technical term for the future too

In [25]:
# start of the index number for the dataframe begins with the 
# If we want to track the rows of the dataframe hence then it will be used by the axis = 0
# If we want to access the rows of the dataframe then at that point it can be used by the axis = 1
# Name of the feature are nothing but the names of the columns

In [26]:
# Now that we have created and made the dataframe and we might make some changes in the dataframe and after making the changes we have to make sure that it will be exported out into the real envirnment

In [27]:
car_data.to_csv("cars_data_exported.csv")

In [28]:
exported_cars_data = pd.read_csv("cars_data_exported.csv")

In [29]:
exported_cars_data

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [30]:
# Now look at that 2 differnt columns there
# But now we have to make sure that these columns are not exported into the csv files then it can be used for the better usability

In [31]:
# Hence we will now export the data after removing indices

In [33]:
car_data.to_csv("cars_data_exported_without_indices.csv", index=False)

In [35]:
cars_data_index_free = pd.read_csv("cars_data_exported_without_indices.csv")

In [36]:
cars_data_index_free

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [37]:
# So this was all for the importing and then exporting file after modifying them